Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/flight_computer/sdkconfig.defaults.m1
# sdkconfig overlay applied ONLY to -DTR_BOARD_M1=1 builds, on top of
# sdkconfig.defaults. Selected by the project CMakeLists, not by the build-dir
# name — see there.
#
# === THIS IS THE ONE THAT CHANGES THE CHIP ===
# Every other flight_computer build targets an ESP32-P4. rocket-computer-mini's
# flight computer (U32) is an ESP32-S3RH2 — the same part as its out computer.
# That is not a variant of the P4 image, it is a different architecture
# (Xtensa, not RISC-V), so this overlay MUST come after sdkconfig.defaults and
# MUST land in a build dir of its own. A stale sdkconfig from a P4 build in the
# same directory is the quiet failure mode here, which is why the project
# CMakeLists also redirects SDKCONFIG into the build dir.
#
#   idf.py -B build_m1 -DTR_BOARD_M1=1 build
#
# If IDF has already fixed a target in build_m1, `idf.py -B build_m1 set-target
# esp32s3` first, or delete the dir — set-target rewrites sdkconfig, and a
# target mismatch surfaces as a wall of unrelated compile errors rather than a
# clear message.
CONFIG_IDF_TARGET="esp32s3"

# === PSRAM: 2 MB in-package quad on the S3RH2 ===
# Same part and same reasoning as the out computer's V9 overlay: the RH2 is the
# embedded-PSRAM S3, the PSRAM sits on SPICS1 (pad 28, externally NC by
# design), and GPIO33-37/47/48 stay usable because the octal restriction does
# not apply to a quad part. IGNORE_NOTFOUND so a board that does not bring it
# up boots anyway rather than panicking.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# === No radios on this processor ===
# The S3 has WiFi and BLE where the P4 has neither, and this processor uses
# neither: the mini's 2.4 GHz chip antenna is on the OUT computer, and U32 has
# no antenna or matching network at all — its LNA_IN is a deliberate
# no-connect. Compiling the stacks in would buy image size and a radio that
# radiates into a via.
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n

# === Brownout: the selector is NOT the same voltage on both targets ===
# sdkconfig.defaults pins CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 and calls it "the
# most-lenient level (2.42V)". That is true on the ESP32-P4 and FALSE here,
# because the two chips number the levels in OPPOSITE directions:
#
#            SEL_5     SEL_6     SEL_7
#   P4       2.42 V    2.52 V    2.60 V   <- higher selector = higher threshold
#   S3       2.67 V    2.56 V    2.44 V   <- higher selector = LOWER threshold
#
# So the inherited SEL_5 gives this processor 2.67 V: not the most lenient
# level but a STRICTER one than the S3's own default (SEL_7), and 0.23 V above
# what the out computer runs on the very same +3V3 rail (its build takes the
# S3 default). The mini FC would therefore brown out first in any supply decay
# and throw away a quarter-volt of the TPS61094 hold-up tail it was supposed
# to have. Pin the S3's actually-most-lenient level, which also matches the OC.
#
# The P4's servo-PWM-init trip that motivated the original pin does not apply:
# it is a different detector on a different die, and this processor's rail is
# behind U30 rather than shared with the servo rail.
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
